In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'shubh'],
    "marks": [92, 34, 24, 17],
    "city":['rampur', 'kolkata','bareilly','antartica']
}

In [ ]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

     name  marks       city
2  skillf     24   bareilly
3   shubh     17  antartica

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [11]:
ser = pd.Series(np.random.rand(34))

In [12]:
ser

0     0.660784
1     0.228060
2     0.432695
3     0.640045
4     0.696629
5     0.775450
6     0.780843
7     0.600814
8     0.842165
9     0.216291
10    0.908608
11    0.152834
12    0.314877
13    0.706873
14    0.945216
15    0.034229
16    0.804054
17    0.560724
18    0.841482
19    0.358111
20    0.300813
21    0.867227
22    0.187713
23    0.334309
24    0.587514
25    0.862068
26    0.221592
27    0.935147
28    0.564234
29    0.756897
30    0.501555
31    0.258734
32    0.851938
33    0.688021
dtype: float64

In [13]:
type(ser)

pandas.core.series.Series

In [14]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [15]:
newdf.head()

          0         1         2         3         4
0  0.673676  0.637566  0.585481  0.819826  0.769939
1  0.943699  0.886686  0.680290  0.234025  0.534079
2  0.553577  0.946814  0.055902  0.155340  0.534687
3  0.355334  0.824447  0.767062  0.947318  0.621711
4  0.218420  0.631604  0.009333  0.052294  0.965802

In [17]:
type(newdf)

pandas.core.frame.DataFrame

In [18]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.508478    0.530044    0.481784    0.502528    0.495142
std      0.285327    0.291455    0.303236    0.286908    0.288454
min      0.001500    0.011391    0.002788    0.001758    0.003995
25%      0.249208    0.271081    0.217407    0.253771    0.220168
50%      0.522123    0.550682    0.482927    0.499984    0.523922
75%      0.739199    0.770372    0.731890    0.720759    0.742584
max      0.998073    0.998786    0.999955    0.997643    0.996958

In [19]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [20]:
newdf[0][0] = "harry"

C:\Users\rzulf\AppData\Local\Temp\ipykernel_19772\2771891818.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "harry"
C:\Users\rzulf\AppData\Local\Temp\ipykernel_19772\2771891818.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "harry"

In [21]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [22]:
newdf.head()

          0         1         2         3         4
0     harry  0.637566  0.585481  0.819826  0.769939
1  0.943699  0.886686  0.680290  0.234025  0.534079
2  0.553577  0.946814  0.055902  0.155340  0.534687
3  0.355334  0.824447  0.767062  0.947318  0.621711
4   0.21842  0.631604  0.009333  0.052294  0.965802

In [23]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [24]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [28]:
newdf.to_numpy()

array([[0.3, 0.6375655619673645, 0.5854814499514448, 0.8198259957076335,
        0.76993882505222],
       [0.9436987610150754, 0.8866859017353863, 0.6802903281845442,
        0.23402454520522098, 0.5340793518274362],
       [0.5535770746567378, 0.946813528911192, 0.05590210279017627,
        0.1553399196574169, 0.5346867180561745],
       ...,
       [0.18130957797427305, 0.3398382526839777, 0.8007532954788694,
        0.43486779994677105, 0.7898016881292529],
       [0.9562496276858361, 0.8811549282515098, 0.12849821935634764,
        0.8055709707844949, 0.19820647275063952],
       [0.05412066454935571, 0.23518564463761193, 0.26497205894237896,
        0.8587236978173206, 0.1501403666068879]],
      shape=(334, 5), dtype=object)

In [26]:
newdf[0][0]=0.3

In [27]:
newdf.head()

          0         1         2         3         4
0       0.3  0.637566  0.585481  0.819826  0.769939
1  0.943699  0.886686  0.680290  0.234025  0.534079
2  0.553577  0.946814  0.055902  0.155340  0.534687
3  0.355334  0.824447  0.767062  0.947318  0.621711
4   0.21842  0.631604  0.009333  0.052294  0.965802

In [29]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.943699,0.553577,0.355334,0.21842,0.806327,0.905631,0.555875,0.483778,0.440736,...,0.731596,0.43887,0.553895,0.124921,0.698952,0.998073,0.895684,0.18131,0.95625,0.054121
1,0.637566,0.886686,0.946814,0.824447,0.631604,0.692436,0.791419,0.942374,0.070728,0.356738,...,0.926495,0.389423,0.655724,0.752328,0.122989,0.550062,0.15111,0.339838,0.881155,0.235186
2,0.585481,0.68029,0.055902,0.767062,0.009333,0.022866,0.769271,0.085984,0.491045,0.521229,...,0.148691,0.619871,0.091489,0.351336,0.340727,0.215355,0.245219,0.800753,0.128498,0.264972
3,0.819826,0.234025,0.15534,0.947318,0.052294,0.292146,0.489041,0.765825,0.462111,0.268764,...,0.540915,0.975721,0.707981,0.986504,0.903654,0.180825,0.444577,0.434868,0.805571,0.858724
4,0.769939,0.534079,0.534687,0.621711,0.965802,0.859888,0.103236,0.025087,0.265266,0.604021,...,0.20407,0.010026,0.901747,0.219994,0.059522,0.206213,0.805775,0.789802,0.198206,0.15014

In [30]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.054121  0.235186  0.264972  0.858724  0.150140
332   0.95625  0.881155  0.128498  0.805571  0.198206
331   0.18131  0.339838  0.800753  0.434868  0.789802
330  0.895684  0.151110  0.245219  0.444577  0.805775
329  0.998073  0.550062  0.215355  0.180825  0.206213
..        ...       ...       ...       ...       ...
4     0.21842  0.631604  0.009333  0.052294  0.965802
3    0.355334  0.824447  0.767062  0.947318  0.621711
2    0.553577  0.946814  0.055902  0.155340  0.534687
1    0.943699  0.886686  0.680290  0.234025  0.534079
0         0.3  0.637566  0.585481  0.819826  0.769939

[334 rows x 5 columns]

In [46]:
df = pd.DataFrame({
    "name":['Alfred', 'Batman','Alfred'],
    "toy":[np.nan,'Batmobile','Bullwhip'],
    "born":[pd.NaT, pd.Timestamp("1930-04-25"),pd.NaT]
})

In [47]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1930-04-25
2  Alfred   Bullwhip        NaT

In [43]:
df.dropna(how='all', axis=1)

       name       born
0    Alfred        NaT
1    Batman 1930-04-25
2  Catwoman        NaT

In [45]:
df.head()

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1930-04-25
2  Catwoman  NaN        NaT

In [52]:
df.drop_duplicates(subset=['name'], keep='last')

     name        toy       born
1  Batman  Batmobile 1930-04-25
2  Alfred   Bullwhip        NaT

In [53]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1930-04-25
2  Alfred   Bullwhip        NaT

In [55]:
df.shape

(3, 3)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [59]:
df['toy'].value_counts(dropna=True)

toy
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [60]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [61]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True